Программа выводит квадрат из звездочек.

Задание:
Напишите программу на языке C, которая принимает на вход от пользователя одно положительное целое число N больше единицы и меньше 10 
и выводит на экран квадрат из звездочек с размером стороны N. 
Для ввода данных используйте функцию scanf(), для вывода данных на экран используйте функцию printf() либо write(). 
Сами данные сохраняйте в программе в переменные. 

Используйте для решения этой задачи вложенные циклы либо for, либо while на Ваше усмотрение.

Sample Input:
5

Sample Output:
*****
*****
*****
*****
*****
