Программа находит наибольшую цифру в числе.

Задание:
Напишите программу на языке C, которая принимает на вход от пользователя одно положительное целое число N больше единицы и меньше 1000000. 
Вывести на экран максимальную цифру во введенном числе. 
Для ввода данных используйте функцию scanf(), для вывода данных на экран используйте функцию printf(). 
Сами данные сохраняйте в программе в переменные. 

Для того, чтобы решить задачу, используйте в цикле операцию % - остаток от деления 
и деление на 10, чтобы уменьшать число на один разряд в каждом проходе цикла. 
Используйте либо цикл while либо for на Ваше усмотрение.

Sample Input:
568

Sample Output:
8
