Программа сложения цифр числа.

Задание:
Напишите программу на языке C, которая принимает на вход от пользователя одно положительное целое число больше единицы и меньше 100000 
и выводит на экран целое число - сумму цифр введенного числа (никакого поясняющего текста, только число). 
Для ввода данных используйте функцию scanf(), для вывода данных на экран используйте функцию printf(). 
Сами данные сохраняйте в программе в переменные. 

Для того, чтобы решить задачу, используйте в цикле операцию % - остаток от деления (суммируйте все остатки в цикле между собой) 
и деление на 10, чтобы уменьшать  число на один разряд в каждом проходе цикла. 
Используйте либо цикл while либо for на Ваше усмотрение.

Sample Input:
178

Sample Output:
16
